import cl from './ModulePages.module.css';

const OfferPage = ({ onClose }) => {
  return (
    <div className={cl.page}>
      <div className={cl.content}>
        <h1 className={cl.header}>
          ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА)<br />
          на надання інформаційно-консультаційних послуг
        </h1>

        <p className={cl.paragraph}>
          Цей договір є офіційною та публічною пропозицією Продавця укласти договір про надання послуг, представлених на сайті https://litaapp.co/ та https://konsttantin.github.io/Lita/. Даний договір є публічним, тобто відповідно до статті 633 Цивільного кодексу України, його умови є однаковими для всіх покупців незалежно від їх статусу (фізична особа, юридична особа, фізична особа-підприємець) без надання переваги одному покупцю перед іншим. Шляхом укладення цього Договору покупець в повному обсязі приймає умови та порядок оформлення замовлення, отримання послуги, відповідальності за недобросовісне замовлення та усі інші умови договору. Договір вважається укладеним з моменту натискання кнопки «Отримати профілактичний план від лікаря за 53 грн» на сторінці результатів тесту і успішною оплатою Покупцем послуги в платіжній системі LiqPay
        </p>

        <h2 className={cl.subHeader}>
          1. Визначення термінів
        </h2>

        <p className={cl.paragraph}>
          1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція Виконавця, адресована невизначеному колу осіб, укласти з Виконавцем договір про надання послуг дистанційним способом (далі - «Договір») на умовах, що містяться в цій Оферті.
        </p>

        <p className={cl.paragraph}>
          1.2. Послуга – оцінка онкологічних ризиків для здоровʼя та рекомендації з профілактики на основі відповідей з опитування, що надається Виконавцем Покупцю у листі на пошту, вказану при оплаті замовлення в системі LiqPay. Ризики, які оцінюються та обстеження, які можуть бути рекомендовані:<br/>
          - Рак молочної залози - мамографія<br/>
          - Рак шийки матки - пап-тест, тест на ВПЛ.<br/>
          - Рак легень - низькодозове КТ легень<br/>
          - Колоректальний рак (КРР) — фекальне імуногістохімічне дослідження; багатоцільовий ДНК-тест калу; кал на приховану кров; колоноскопія; КТ колонографія; гнучка сигмоїдоскопія.
        </p>

        <p className={cl.paragraph}>
          1.3. Веб-додаток – сайт Виконавця за адресою <strong>https://konsttantin.github.io/Lita/</strong> створений для проходження тестування онлайн та укладення договорів по виконанню послуг на основі даних опитування та на підставі ознайомлення Покупця із запропонованим Продавцем описом Послуги за допомогою мережі Інтернет.
        </p>

        <p className={cl.paragraph}>
          1.4. Покупець – дієздатна фізична особа, яка досягла 18 років, отримує інформацію від Виконавця, розміщує замовлення щодо замовлення послуги, що представлена на сайті веб-додатку для цілей, що не пов&#8217;язані зі здійсненням підприємницької діяльності, або юридична особа чи фізична особа-підприємець.
        </p>

        <p className={cl.paragraph}>
          1.5. Виконавець – Товариство з обмеженою відповідальністю «Літа» (код ЄДРПОУ 45136589), юридична особа, яка створена і діє відповідно до чинного законодав ства України, місцезнаходження якої: Київська область, Бориспільський район, місто Бориспіль, провулок Новий, будинок 1а, квартира 20.
        </p>

        <h2 className={cl.subHeader}>
          2. Предмет Договору
        </h2>

        <p className={cl.paragraph}>
          2.1. Виконавець зобов’язується надати Покупцю послугу онлайн оцінки онкологічних ризиків для здоровʼя після заповнення опитувальника у веб-додатку, а Покупець зобов’язується оплатити і прийняти Послугу на умовах цього Договору. Покупець погоджується, що висновок не є остаточним діагнозом і потребує очної консультації з лікарем.
        </p>

        <p className={cl.paragraph}>
          2.2. Датою укладення Договору-оферти (акцептом оферти) та моментом повного й беззаперечного прийняття Покупцем умов Договору вважається дата сплати Покупцем замовлення.
        </p>

        <h2 className={cl.subHeader}>
          3. Оформлення Замовлення
        </h2>

        <p className={cl.paragraph}>
          3.1. Замовник самостійно оформлює замовлення у веб-додатку за адресою <strong>https://konsttantin.github.io/Lita/</strong> на сторінці результатів тесту.
        </p>

        <p className={cl.paragraph}>
          3.2. Виконавець має право відмовитися від надання послуги Замовнику у випадку, якщо відомості, вказані Замовником під час оформлення замовлення, є неповними або викликають підозру щодо їх дійсності.
        </p>

        <p className={cl.paragraph}>
          3.3. При оформленні замовлення на сторінці платіжної системи Замовник зобов&#8217;язується надати наступну обов’язкову інформацію, необхідну Виконавцю для виконання замовлення:
        </p>

        <p className={cl.paragraph}>
          3.3.1. електронну адресу, за якою слід відправити результати
        </p>

        <p className={cl.paragraph}>
          3.4. Ціна послуги вказана на кнопці «Отримати профілактичний план від лікаря за 53 грн».
        </p>

        <p className={cl.paragraph}>
          3.5. У разі ненадання необхідної інформації чи надання недостовірної інформації Покупцем, Виконавець не несе відповідальності за надання якісної послуги Покупцю при оформленні послуги в веб-додатку.
        </p>

        <p className={cl.paragraph}>
          3.6. Ухвалення Замовником умов цієї Оферти здійснюється за допомогою натискання кнопки «Отримати профілактичний план від лікаря за 53 грн» на сторінці результатів тесту і успішної оплати послуги в платіжній системі LiqPay.
        </p>

        <p className={cl.paragraph}>
          3.7. Покупець несе відповідальність за достовірність наданої інформації при оформленні Замовлення та заповненні опитувальника у веб-додатку.
        </p>

        <p className={cl.paragraph}>
          3.8. Укладаючи Договір, тобто акцептуючи умови даної пропозиції (запропоновані умови надання Послуги), шляхом оформлення Замовлення, Покупець підтверджує наступне:
        </p>

        <p className={cl.paragraph}>
          а) Замовник цілком і повністю ознайомлений, і згоден з умовами цієї пропозиції (оферти);
        </p>

        <p className={cl.paragraph}>
          б) він дає дозвіл на збір, обробку та передачу персональних даних, дозвіл на обробку персональних даних діє протягом усього терміну дії Договору, а також протягом необмеженого терміну після закінчення його дії. Крім цього, укладенням договору Покупець підтверджує, що він повідомлений (без додаткового повідомлення) про права, встановлених Законом України <q>Про захист персональних даних</q>, про цілі збору даних, а також про те, що його персональні дані передаються Виконавцю з метою можливості виконання умов цього Договору, можливості проведення взаєморозрахунків, а також для отримання рахунків, актів та інших документів. Покупець також погоджується з тим, що Виконавець має право надавати доступ та передавати його персональні дані третім особам без будь-яких додаткових повідомлень Покупця з метою виконання замовлення Покупця. Обсяг прав Покупця, як суб&#8217;єкта персональних даних відповідно до Закону України <q>Про захист персональних даних</q> йому відомий і зрозумілий;
        </p>

        <p className={cl.paragraph}>
          в) результат послуги з визначення онкологічних ризиків не є кінцевим медичним діагнозом та потребують очної консультації з лікарем для підтвердження.
        </p>

        <h2 className={cl.subHeader}>
          4. Ціна і Доставка Товару
        </h2>

        <p className={cl.paragraph}>
          4.1 Ціна Послуги - визначається Виконавцем самостійно та вказана у веб-додатку у гривнях з урахуванням ПДВ.
        </p>

        <p className={cl.paragraph}>
          4.2 Ціни на Послуги можуть змінюватися Виконавцем в односторонньому порядку залежно від кон&#8217;юнктури ринку. При цьому ціна окремої послуги, вартість якої оплачена Замовником в повному обсязі, не може бути змінена Виконавцем в односторонньому порядку.
        </p>

        <p className={cl.paragraph}>
          4.3. Зобов&#8217;язання Покупця по оплаті Товару вважаються виконаними з моменту надходження Виконавцю коштів на його рахунок.
        </p>

        <h2 className={cl.subHeader}>
          5. Права та обов’язки Сторін
        </h2>

        <p className={cl.paragraph}>
          5.1. Виконавець зобов’язаний:
        </p>

        <p className={cl.paragraph}>
          5.1.1. Надіслати Покупцеві документ-профілактичний план на вказану під час оплати в платіжній системі LiqPay електронну адресу у відповідності до умов цього Договору та замовлення Покупця протягом 3х робочих днів з моменту оплати послуги.
        </p>

        <p className={cl.paragraph}>
          5.1.2. Не розголошувати будь-яку приватну інформацію про Покупця і не надавати доступ до цієї інформації третім особам, за винятком випадків, передбачених законодавством та під час виконання Замовлення Покупця.
        </p>

        <p className={cl.paragraph}>
          5.2. Виконавець має право:
        </p>

        <p className={cl.paragraph}>
          5.2.1 Змінювати умови цього Договору, а також ціни на Товари та послуги, в односторонньому порядку, розміщуючи їх на сайті. Всі зміни набувають чинності з моменту їх публікації.
        </p>

        <p className={cl.paragraph}>
          5.3 Покупець зобов&#8217;язується:
        </p>

        <p className={cl.paragraph}>
          5.3.1 До моменту укладення Договору ознайомитися зі змістом Договору, умовами Договору і цінами, запропонованими Продавцем на сайті.
        </p>

        <p className={cl.paragraph}>
          5.3.2 Вносити тільки достовірну інформацію в якості відповідей на питання опитувальника.
        </p>

        <p className={cl.paragraph}>
          5.3.3 На виконання Виконавцем своїх зобов&#8217;язань перед Покупцем останній повинен повідомити всі необхідні дані, що однозначно ідентифікують його як Покупця, і достатні для доставки Покупцеві замовленої Послуги.
        </p>

        <h2 className={cl.subHeader}>
          6. Відповідальність
        </h2>

        <p className={cl.paragraph}>
          6.1. Виконавець не несе відповідальності за шкоду, заподіяну Покупцеві або третім особам внаслідок неналежного надання Покупцем необхідної інформації під час заповнення опитувальника у веб-додатку чи при оплаті послуги в платіжній системі LiqPay.
        </p>

        <p className={cl.paragraph}>
          6.2. Виконавець не несе відповідальності за неналежне, несвоєчасне виконання Замовлень і своїх зобов&#8217;язань у випадку надання Покупцем недостовірної або помилкової інформації.
        </p>

        <p className={cl.paragraph}>
          6.3. Виконавець і Покупець несуть відповідальність за виконання своїх зобов&#8217;язань відповідно до чинного законодавства України і положень цього Договору.
        </p>

        <p className={cl.paragraph}>
          6.4. Виконавець або Покупець звільняються від відповідальності за повне або часткове невиконання своїх зобов&#8217;язань, якщо невиконання є наслідком форс-мажорних обставин як: війна або військові дії, землетрус, повінь, пожежа та інші стихійні лиха, що виникли незалежно від волі Виконавця і / або Покупця після укладення цього договору. Сторона, яка не може виконати свої зобов&#8217;язання, негайно повідомляє про це іншу Сторону.
        </p>

        <h2 className={cl.subHeader}>
          7. Конфіденційність і захист персональних даних.
        </h2>

        <p className={cl.paragraph}>
          7.1. Надаючи свої персональні дані, Покупець надає Виконавцеві свою добровільну згоду на обробку, використання (у тому числі і передачу) своїх персональних даних, а також вчинення інших дій, передбачених Законом України «Про захист персональних даних», без обмеження терміну дії такої згоди.
        </p>

        <p className={cl.paragraph}>
          7.2. Виконавець зобов&#8217;язується не розголошувати отриману від Покупця інформацію. Не вважається порушенням надання Виконавцем інформації контрагентам і третім особам, що діють на підставі договору з Продавцем, в тому числі і для виконання зобов&#8217;язань перед Покупцем, а також у випадках, коли розкриття такої інформації встановлено вимогами чинного законодавства України.
        </p>

        <p className={cl.paragraph}>
          7.3. Покупець несе відповідальність за підтримання своїх персональних даних в актуальному стані. Продавець не несе відповідальності за неякісне виконання або невиконання своїх зобов&#8217;язань у зв&#8217;язку з неактуальністю інформації про Покупця або невідповідністю її дійсності.
        </p>

        <h2 className={cl.subHeader}>
          8. Інші умови
        </h2>

        <p className={cl.paragraph}>
          8.1. Цей договір укладено на території України і діє відповідно до чинного законодавства України.
        </p>

        <p className={cl.paragraph}>
          8.2. Усі спори, що виникають між Виконавцем і Продавцем, вирішуються шляхом переговорів. У випадку недосягнення врегулювання спірного питання шляхом переговорів, Виконавець та/або Продавець мають право звернутися за вирішенням спору до судових органів відповідно до чинного законодавства України.
        </p>

        <p className={cl.paragraph}>
          8.3. Виконавець має право вносити зміни до цього Договору в односторонньому порядку, передбаченому п. 5.2.1. Договору. Крім того, зміни до Договору також можуть бути внесені за взаємною згодою Сторін в порядку, передбаченому чинним законодавством України.
        </p>

        <h2 className={cl.subHeader}>
          АДРЕСА ТА РЕКВІЗИТИ ПРОДАВЦЯ:
        </h2>

        <p className={cl.paragraph}>
          <strong>ТОВ «Літа»</strong><br />
          Київська область, Бориспільський район, місто Бориспіль, провулок Новий, будинок 1а, квартира 20
        </p>

        <p className={cl.paragraph}>
          п/р UA623052990000026003030134946 в АТ КБ <q>ПРИВАТБАНК</q> МФО 305299 АТ КБ <q>ПРИВАТБАНК</q><br />
          Код ЄДРПОУ 45136589<br />
          тел. (093) 7619712
        </p>
      </div>

      <button
        className={cl.backButton}
        onClick={onClose}
      >
        Назад
      </button>
    </div>
  );
};

export default OfferPage;